{
  "storytelling": [
    "Once upon a time, a fisherman found a bottle.",
    "In a land of perpetual twilight, a lone wolf searched for its pack.",
    "A young girl discovered a glowing tree deep in the forest.",
    "The robot blinked for the first time, wondering who made it.",
    "A storm was coming, and the villagers whispered of ancient curses.",
    "The knight rode into the dark woods, where no one returned.",
    "A painter woke up in a world made entirely of colors she dreamed.",
    "Two children found a staircase leading beneath the lake.",
    "The last dragon landed on a city rooftop at sunset.",
    "She stepped into the mirror and vanished.",
    "He opened a dusty book and heard a voice speak.",
    "The sky cracked open, revealing a second moon.",
    "A stranger arrived in town with a map and no name.",
    "They found an old watch that reversed time.",
    "The lighthouse blinked in Morse code every midnight.",
    "Her shadow started walking in the opposite direction.",
    "The statue in the park started whispering secrets.",
    "A cat led him to a hidden door in the alley.",
    "The wind carried messages only children could hear.",
    "A boy built a robot that dreamed of stars.",
    "A secret garden bloomed in the school basement.",
    "Time stopped every time she blinked.",
    "An elevator opened to a floor that didn’t exist.",
    "Every photo she took changed after a day.",
    "The town had no clocks, and no one aged.",
    "He drew a door and stepped through it.",
    "The moon turned red and animals began to speak.",
    "His reflection stopped copying him.",
    "She could speak any language after dreaming it.",
    "They found an old radio that played voices from the future.",
    "An umbrella that rained only over the holder.",
    "The attic held memories that weren’t hers.",
    "Books that whispered when no one watched.",
    "A town where everyone swapped dreams at night."
  ],
  "procedural": [
    "Preheat oven to 350°F. Mix flour, sugar, milk, eggs. Bake 30 minutes.",
    "Boil 2 cups of water. Add rice. Cover and simmer for 20 minutes.",
    "Turn off power. Unscrew old lightbulb. Replace with new one.",
    "Wash hands. Apply soap. Scrub for 20 seconds. Rinse and dry.",
    "Plug in monitor. Connect HDMI to laptop. Power on both devices.",
    "Open browser. Go to email site. Enter credentials to log in.",
    "Apply primer. Wait 10 minutes. Paint wall with two coats.",
    "Measure 1 cup oats. Add 2 cups water. Microwave 3 minutes.",
    "Add 3 tbsp oil to pan. Sauté onions 5 mins. Add spices.",
    "Charge battery overnight. Unplug. Insert into device.",
    "Fill kettle with water. Boil. Pour over tea bag. Steep 5 mins.",
    "Log into portal. Navigate to Grades. Download report.",
    "Place clothes in washer. Add detergent. Start wash cycle.",
    "Insert SIM card into phone. Power on. Wait for signal.",
    "Mix cement and sand. Add water. Stir. Pour into mold.",
    "Plug phone into charger. Leave for 1 hour.",
    "Login to account. Click settings. Select dark mode.",
    "Measure and cut wood. Nail pieces together. Sand edges.",
    "Pour batter into tray. Bake 25 minutes at 375°F.",
    "Update software. Restart device. Confirm installation.",
    "Print document. Sign at bottom. Scan and email back.",
    "Add coolant to car radiator. Close cap. Start engine.",
    "Stir paint. Dip brush. Apply even strokes on surface.",
    "Chop vegetables. Sauté with oil. Simmer with sauce.",
    "Fill pot with water. Add pasta. Cook 8–10 minutes.",
    "Power off router. Wait 30 seconds. Power it back on.",
    "Scoop ice cream. Add toppings. Serve with spoon.",
    "Create folder. Rename it. Move files inside.",
    "Record video. Save to gallery. Upload to cloud.",
    "Unbox device. Plug in. Follow on-screen setup.",
    "Crack eggs. Whisk with milk. Pour into pan.",
    "Connect Bluetooth speaker. Play test sound.",
    "Open camera. Set to portrait mode. Take picture."
  ],
  "factual": [
    "What is the capital of Canada?",
    "Who discovered penicillin?",
    "What year did the Berlin Wall fall?",
    "Which planet is known as the Red Planet?",
    "What is the square root of 144?",
    "Who was the first President of the United States?",
    "What is the chemical symbol for gold?",
    "How many continents are there?",
    "What language is spoken in Brazil?",
    "What is the longest river in the world?",
    "Who painted the Mona Lisa?",
    "What is the speed of light?",
    "Which gas do plants absorb from the air?",
    "What currency is used in Japan?",
    "What is the largest mammal on Earth?",
    "Which element has the atomic number 1?",
    "What is the freezing point of water?",
    "What organ pumps blood through the body?",
    "What is the capital of Australia?",
    "Who wrote 'Romeo and Juliet'?",
    "What is the smallest prime number?",
    "What galaxy is Earth located in?",
    "Who invented the telephone?",
    "Which country has the most population?",
    "What is the tallest mountain in the world?",
    "How many legs does a spider have?",
    "What do bees produce?",
    "What is H2O commonly known as?",
    "How many bones are in the human body?",
    "What is the main language spoken in Egypt?",
    "What does DNA stand for?",
    "What is the main ingredient in guacamole?",
    "How many sides does a hexagon have?"
  ]
}